app/controllers/api/rodents_controller.rb

  def index
    @rodents = Rodent.all
---
SELECT "rodents".* FROM "rodents"