app/controllers/api/tours_controller.rb

  def index
    tours = Tour.all
    @tours = tours.includes(:rodents)
---
SELECT  "tours".* FROM "tours" ORDER BY "tours"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "tours".* FROM "tours"
SELECT "rodents".* FROM "rodents" WHERE "rodents"."tour_id" = $1  [["tour_id", 11]]

  def create
    rodents = create_rodents
    @tour = Tour.new(tour_params)
    @tour.user_id = current_user.id
    if @tour.save
---
INSERT INTO "tours" ("user_id", "name", "distance", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 7], ["name", "Distance test"], ["distance", 0.8], ["created_at", "2020-02-20 16:38:36.182802"], ["updated_at", "2020-02-20 16:38:36.182802"], ["description", "other other other"]]

  def save_the_rodents(rodents, tour_id)
    rodents.each_with_index do |subarr, i|
      @rodent = Rodent.new
      @rodent.lat = subarr[0].to_f
      @rodent.lng = subarr[1].to_f
      @rodent.species = subarr[2]
      @rodent.tour_id = tour_id
      @rodent.ord = i
      @rodent.save
---
INSERT INTO "rodents" ("lat", "lng", "created_at", "updated_at", "tour_id", "species", "ord") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["lat", 40.677837984204466], ["lng", -73.98268170767503], ["created_at", "2020-02-19 04:56:34.374547"], ["updated_at", "2020-02-19 04:56:34.374547"], ["tour_id", 8], ["species", "rat"], ["ord", 0]]