app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "first_name", "last_name", "password_digest", "session_token", "birthday", "gender", "created_at", "updated_at", "country") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save